run/alfa000/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
    (-8.000000  0.000000  0.000000)
    (0.000000  0.000000  8.000000)
    (0.750000  0.000000  8.000000)
    (16.000000  0.000000  8.000000)
    (-0.250000  0.000000  0.000000)
    (0.011293  0.000000  0.060069)
    (-0.000202  0.000000  -0.023829)
    (0.750000  0.000000  0.000000)
    (16.000000  0.000000  0.000000)
    (0.000000  0.000000  -8.000000)
    (0.750000  0.000000  -8.000000)
    (16.000000  0.000000  -8.000000)
    (-8.000000  0.100000  0.000000)
    (0.000000  0.100000  8.000000)
    (0.750000  0.100000  8.000000)
    (16.000000  0.100000  8.000000)
    (-0.250000  0.100000  0.000000)
    (0.011293  0.100000  0.060069)
    (-0.000202  0.100000  -0.023829)
    (0.750000  0.100000  0.000000)
    (16.000000  0.100000  0.000000)
    (0.000000  0.100000  -8.000000)
    (0.750000  0.100000  -8.000000)
    (16.000000  0.100000  -8.000000)
);

blocks
(
    hex (16 17 13 12 4 5 1 0)     (40 100 1) edgeGrading (4 100 1)
    hex (17 19 14 13 5 7 2 1)     (40 100 1) simpleGrading (1 100 1)
    hex (19 20 15 14 7 8 3 2)     (50 100 1) simpleGrading (100 100 1)
    hex (4 6 9 0 16 18 21 12)     (40 100 1) edgeGrading (4 100 1)
    hex (6 7 10 9 18 19 22 21)    (40 100 1) simpleGrading (1 100 1)
    hex (7 8 11 10 19 20 23 22)   (50 100 1) simpleGrading (100 100 1)
);

edges
(
    spline 4 5
    (
       (-0.250000  0.000000  0.000000)
       (-0.249985  0.000000  0.000367)
       (-0.249958  0.000000  0.000621)
       (-0.249918  0.000000  0.000881)
       (-0.249865  0.000000  0.001146)
       (-0.249779  0.000000  0.001487)
       (-0.249673  0.000000  0.001835)
       (-0.249511  0.000000  0.002282)
       (-0.249317  0.000000  0.002741)
       (-0.249092  0.000000  0.003212)
       (-0.248765  0.000000  0.003816)
       (-0.248389  0.000000  0.004436)
       (-0.247964  0.000000  0.005071)
       (-0.247490  0.000000  0.005720)
       (-0.246652  0.000000  0.006760)
       (-0.245695  0.000000  0.007828)
       (-0.244334  0.000000  0.009197)
       (-0.242790  0.000000  0.010599)
       (-0.240605  0.000000  0.012388)
       (-0.238137  0.000000  0.014208)
       (-0.234659  0.000000  0.016513)
       (-0.230748  0.000000  0.018835)
       (-0.225255  0.000000  0.021740)
       (-0.219100  0.000000  0.024624)
       (-0.212295  0.000000  0.027465)
       (-0.200389  0.000000  0.031775)
       (-0.186984  0.000000  0.035879)
       (-0.172147  0.000000  0.039733)
       (-0.155956  0.000000  0.043302)
       (-0.138497  0.000000  0.046563)
       (-0.119861  0.000000  0.049501)
       (-0.100145  0.000000  0.052103)
       (-0.079446  0.000000  0.054366)
       (-0.057860  0.000000  0.056289)
       (-0.035483  0.000000  0.057876)
       (-0.012404  0.000000  0.059133)
       (0.011293  0.000000  0.060069)
    )
    spline 5 7
    (
       (0.011293  0.000000  0.060069)
       (0.035529  0.000000  0.060697)
       (0.060234  0.000000  0.061029)
       (0.085344  0.000000  0.061079)
       (0.110804  0.000000  0.060861)
       (0.136565  0.000000  0.060391)
       (0.162584  0.000000  0.059680)
       (0.188825  0.000000  0.058740)
       (0.215257  0.000000  0.057580)
       (0.241853  0.000000  0.056208)
       (0.268593  0.000000  0.054627)
       (0.295459  0.000000  0.052836)
       (0.322438  0.000000  0.050832)
       (0.349523  0.000000  0.048609)
       (0.376713  0.000000  0.046156)
       (0.404016  0.000000  0.043464)
       (0.431453  0.000000  0.040521)
       (0.459057  0.000000  0.037318)
       (0.486884  0.000000  0.033850)
       (0.515012  0.000000  0.030121)
       (0.543552  0.000000  0.026146)
       (0.572651  0.000000  0.021959)
       (0.602504  0.000000  0.017619)
       (0.633361  0.000000  0.013214)
       (0.664766  0.000000  0.008975)
       (0.691036  0.000000  0.005740)
       (0.712945  0.000000  0.003332)
       (0.731137  0.000000  0.001570)
       (0.750000  0.000000  0.000000)
    )
    spline 4 6
    (
       (-0.250000  0.000000  0.000000)
       (-0.249997  0.000000  -0.000110)
       (-0.249990  0.000000  -0.000220)
       (-0.249977  0.000000  -0.000330)
       (-0.249959  0.000000  -0.000441)
       (-0.249936  0.000000  -0.000552)
       (-0.249900  0.000000  -0.000692)
       (-0.249857  0.000000  -0.000832)
       (-0.249806  0.000000  -0.000973)
       (-0.249747  0.000000  -0.001114)
       (-0.249662  0.000000  -0.001292)
       (-0.249566  0.000000  -0.001471)
       (-0.249457  0.000000  -0.001650)
       (-0.249305  0.000000  -0.001875)
       (-0.249135  0.000000  -0.002102)
       (-0.248946  0.000000  -0.002329)
       (-0.248685  0.000000  -0.002615)
       (-0.248395  0.000000  -0.002902)
       (-0.247994  0.000000  -0.003262)
       (-0.247548  0.000000  -0.003624)
       (-0.247060  0.000000  -0.003988)
       (-0.246210  0.000000  -0.004558)
       (-0.245256  0.000000  -0.005130)
       (-0.243915  0.000000  -0.005847)
       (-0.242411  0.000000  -0.006563)
       (-0.239733  0.000000  -0.007679)
       (-0.236652  0.000000  -0.008785)
       (-0.233166  0.000000  -0.009875)
       (-0.225167  0.000000  -0.011945)
       (-0.215557  0.000000  -0.013908)
       (-0.204293  0.000000  -0.015738)
       (-0.191337  0.000000  -0.017415)
       (-0.176662  0.000000  -0.018919)
       (-0.160259  0.000000  -0.020238)
       (-0.142136  0.000000  -0.021361)
       (-0.122321  0.000000  -0.022281)
       (-0.100863  0.000000  -0.022996)
       (-0.077828  0.000000  -0.023504)
       (-0.053303  0.000000  -0.023808)
       (-0.027390  0.000000  -0.023914)
       (-0.000202  0.000000  -0.023829)
    )
    spline 6 7
    (
       (-0.000202  0.000000  -0.023829)
       (0.028134  0.000000  -0.023562)
       (0.057489  0.000000  -0.023126)
       (0.087728  0.000000  -0.022534)
       (0.118719  0.000000  -0.021801)
       (0.150333  0.000000  -0.020941)
       (0.182452  0.000000  -0.019971)
       (0.214967  0.000000  -0.018907)
       (0.247787  0.000000  -0.017764)
       (0.280835  0.000000  -0.016556)
       (0.314058  0.000000  -0.015299)
       (0.347422  0.000000  -0.014003)
       (0.380916  0.000000  -0.012682)
       (0.414553  0.000000  -0.011344)
       (0.448368  0.000000  -0.009999)
       (0.482417  0.000000  -0.008655)
       (0.516774  0.000000  -0.007321)
       (0.551533  0.000000  -0.006005)
       (0.586796  0.000000  -0.004721)
       (0.622673  0.000000  -0.003482)
       (0.658409  0.000000  -0.002338)
       (0.687561  0.000000  -0.001488)
       (0.711277  0.000000  -0.000863)
       (0.730516  0.000000  -0.000408)
       (0.750000  0.000000  0.000000)
    )
    spline 16 17
    (
       (-0.250000  0.100000  0.000000)
       (-0.249985  0.100000  0.000367)
       (-0.249958  0.100000  0.000621)
       (-0.249918  0.100000  0.000881)
       (-0.249865  0.100000  0.001146)
       (-0.249779  0.100000  0.001487)
       (-0.249673  0.100000  0.001835)
       (-0.249511  0.100000  0.002282)
       (-0.249317  0.100000  0.002741)
       (-0.249092  0.100000  0.003212)
       (-0.248765  0.100000  0.003816)
       (-0.248389  0.100000  0.004436)
       (-0.247964  0.100000  0.005071)
       (-0.247490  0.100000  0.005720)
       (-0.246652  0.100000  0.006760)
       (-0.245695  0.100000  0.007828)
       (-0.244334  0.100000  0.009197)
       (-0.242790  0.100000  0.010599)
       (-0.240605  0.100000  0.012388)
       (-0.238137  0.100000  0.014208)
       (-0.234659  0.100000  0.016513)
       (-0.230748  0.100000  0.018835)
       (-0.225255  0.100000  0.021740)
       (-0.219100  0.100000  0.024624)
       (-0.212295  0.100000  0.027465)
       (-0.200389  0.100000  0.031775)
       (-0.186984  0.100000  0.035879)
       (-0.172147  0.100000  0.039733)
       (-0.155956  0.100000  0.043302)
       (-0.138497  0.100000  0.046563)
       (-0.119861  0.100000  0.049501)
       (-0.100145  0.100000  0.052103)
       (-0.079446  0.100000  0.054366)
       (-0.057860  0.100000  0.056289)
       (-0.035483  0.100000  0.057876)
       (-0.012404  0.100000  0.059133)
       (0.011293  0.100000  0.060069)
    )
    spline 17 19
    (
       (0.011293  0.100000  0.060069)
       (0.035529  0.100000  0.060697)
       (0.060234  0.100000  0.061029)
       (0.085344  0.100000  0.061079)
       (0.110804  0.100000  0.060861)
       (0.136565  0.100000  0.060391)
       (0.162584  0.100000  0.059680)
       (0.188825  0.100000  0.058740)
       (0.215257  0.100000  0.057580)
       (0.241853  0.100000  0.056208)
       (0.268593  0.100000  0.054627)
       (0.295459  0.100000  0.052836)
       (0.322438  0.100000  0.050832)
       (0.349523  0.100000  0.048609)
       (0.376713  0.100000  0.046156)
       (0.404016  0.100000  0.043464)
       (0.431453  0.100000  0.040521)
       (0.459057  0.100000  0.037318)
       (0.486884  0.100000  0.033850)
       (0.515012  0.100000  0.030121)
       (0.543552  0.100000  0.026146)
       (0.572651  0.100000  0.021959)
       (0.602504  0.100000  0.017619)
       (0.633361  0.100000  0.013214)
       (0.664766  0.100000  0.008975)
       (0.691036  0.100000  0.005740)
       (0.712945  0.100000  0.003332)
       (0.731137  0.100000  0.001570)
       (0.750000  0.100000  0.000000)
    )
    spline 16 18
    (
       (-0.250000  0.100000  0.000000)
       (-0.249997  0.100000  -0.000110)
       (-0.249990  0.100000  -0.000220)
       (-0.249977  0.100000  -0.000330)
       (-0.249959  0.100000  -0.000441)
       (-0.249936  0.100000  -0.000552)
       (-0.249900  0.100000  -0.000692)
       (-0.249857  0.100000  -0.000832)
       (-0.249806  0.100000  -0.000973)
       (-0.249747  0.100000  -0.001114)
       (-0.249662  0.100000  -0.001292)
       (-0.249566  0.100000  -0.001471)
       (-0.249457  0.100000  -0.001650)
       (-0.249305  0.100000  -0.001875)
       (-0.249135  0.100000  -0.002102)
       (-0.248946  0.100000  -0.002329)
       (-0.248685  0.100000  -0.002615)
       (-0.248395  0.100000  -0.002902)
       (-0.247994  0.100000  -0.003262)
       (-0.247548  0.100000  -0.003624)
       (-0.247060  0.100000  -0.003988)
       (-0.246210  0.100000  -0.004558)
       (-0.245256  0.100000  -0.005130)
       (-0.243915  0.100000  -0.005847)
       (-0.242411  0.100000  -0.006563)
       (-0.239733  0.100000  -0.007679)
       (-0.236652  0.100000  -0.008785)
       (-0.233166  0.100000  -0.009875)
       (-0.225167  0.100000  -0.011945)
       (-0.215557  0.100000  -0.013908)
       (-0.204293  0.100000  -0.015738)
       (-0.191337  0.100000  -0.017415)
       (-0.176662  0.100000  -0.018919)
       (-0.160259  0.100000  -0.020238)
       (-0.142136  0.100000  -0.021361)
       (-0.122321  0.100000  -0.022281)
       (-0.100863  0.100000  -0.022996)
       (-0.077828  0.100000  -0.023504)
       (-0.053303  0.100000  -0.023808)
       (-0.027390  0.100000  -0.023914)
       (-0.000202  0.100000  -0.023829)
    )
    spline 18 19
    (
       (-0.000202  0.100000  -0.023829)
       (0.028134  0.100000  -0.023562)
       (0.057489  0.100000  -0.023126)
       (0.087728  0.100000  -0.022534)
       (0.118719  0.100000  -0.021801)
       (0.150333  0.100000  -0.020941)
       (0.182452  0.100000  -0.019971)
       (0.214967  0.100000  -0.018907)
       (0.247787  0.100000  -0.017764)
       (0.280835  0.100000  -0.016556)
       (0.314058  0.100000  -0.015299)
       (0.347422  0.100000  -0.014003)
       (0.380916  0.100000  -0.012682)
       (0.414553  0.100000  -0.011344)
       (0.448368  0.100000  -0.009999)
       (0.482417  0.100000  -0.008655)
       (0.516774  0.100000  -0.007321)
       (0.551533  0.100000  -0.006005)
       (0.586796  0.100000  -0.004721)
       (0.622673  0.100000  -0.003482)
       (0.658409  0.100000  -0.002338)
       (0.687561  0.100000  -0.001488)
       (0.711277  0.100000  -0.000863)
       (0.730516  0.100000  -0.000408)
       (0.750000  0.100000  0.000000)
    )
    arc 0 1 (-5.656854  0.000000  5.656854)
    arc 0 9 (-5.656854  0.000000  -5.656854)
    arc 12 13 (-5.656854  0.100000  5.656854)
    arc 12 21 (-5.656854  0.100000  -5.656854)
);

boundary 
( 
    inlet 
    { 
        type patch; 
        faces 
        ( 
            (13 12 0 1)
            (12 21 9 0)
        ); 
    } 

    outlet 
    { 
        type patch; 
        faces 
        ( 
            (23 20 8 11)
            (20 15 3 8)
        ); 
    } 

    topAndBottom 
    { 
        type patch; 
        faces 
        ( 
            (15 14 2 3)
            (14 13 1 2)
            (21 22 10 9)
            (22 23 11 10)
        ); 
    } 

    airfoil 
    { 
        type wall; 
        faces 
        ( 
            (17 16 4 5)
            (19 17 5 7)
            (16 18 6 4)
            (18 19 7 6)
        ); 
    } 
); 
 
mergePatchPairs 
( 
); 
 
// ************************************************************************* // 
