run/alfa000/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          80;
        startFace       51690;
    }
    outlet
    {
        type            patch;
        nFaces          200;
        startFace       51770;
    }
    topAndBottom
    {
        type            patch;
        nFaces          180;
        startFace       51970;
    }
    airfoil
    {
        type            wall;
        inGroups        1(wall);
        nFaces          160;
        startFace       52150;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          52000;
        startFace       52310;
    }
)

// ************************************************************************* //
