run/alfa000/system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

forceCoeffs1
{
    type            forceCoeffs;

    libs            ("libforces.so");

    writeControl    timeStep;
    timeInterval    1;

    log             yes;

    patches         ( "airfoil.*" );
    rho             rhoInf;      // Indicates incompressible
    rhoInf          1.225;       // Redundant for incompressible
    liftDir         (0 0 1);
    dragDir         (1 0 0);
    CofR            (0.25 0 0);  // aerodynamic center for momentum calculation
    pitchAxis       (0 1 0);
    magUInf         1.5;
    lRef            1.0;         // reference chord
    Aref            0.1;         // reference area (chord*span)

}

